tap "amir20/dtop"
tap "hashicorp/tap"
tap "joshmedeski/sesh"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
# TIFF library and utilities
brew "libtiff"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Library to render SVG files using Cairo
brew "librsvg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Postgres C API library
brew "libpq", link: true
# Apache Kafka C/C++ library
brew "librdkafka"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Paste PNG into files
brew "pngpaste"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Generic machine emulator and virtualizer
brew "qemu"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Terraform
brew "hashicorp/tap/terraform"
# Vault
brew "hashicorp/tap/vault"
# Smart terminal session manager
brew "joshmedeski/sesh/sesh"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# App for managing battery charging
cask "batfi"
# A terminal-based Docker container monitoring tool
cask "dtop"
cask "font-fira-code-nerd-font"
# IRC client
cask "halloy"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/spf13/cobra-cli"
go "github.com/daixiang0/gci"
go "github.com/tetafro/godot/cmd/godot"
go "mvdan.cc/gofumpt"
go "github.com/netskope/goproject"
go "github.com/securego/gosec/v2/cmd/gosec"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/golang/mock/mockgen"
go "github.com/netskope/nsgocoverreport"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/mgechev/revive"
