tap "jesseduffield/lazydocker"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "teamookla/speedtest"
# TIFF library and utilities
brew "libtiff"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# OpenType text shaping engine
brew "harfbuzz"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# Linux virtual machines
brew "lima"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Python version management
brew "pyenv"
# Generic machine emulator and virtualizer
brew "qemu"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# App for managing battery charging
cask "batfi"
# IRC client
cask "halloy"
# Media player based on MPlayer and mplayer2
cask "stolendata-mpv"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "honnef.co/go/tools/cmd/staticcheck"
